from string import Template

#### مطالبات RAG ####

#### النظام ####

system_prompt = "\n".join([
    "أنت مساعد لإنشاء رد على استفسار المستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء رد بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء رد.",
    "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في ردك. تجنب المعلومات غير الضرورية.",
])

#### المستندات ####
document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### التذييل ####
footer_prompt = Template(
    "\n".join([
        "استنادًا فقط إلى المستندات أعلاه، يرجى إنشاء إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
    ])
)
